Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_1 (InputLayer)             (None, 160, 160, 3)   0                                            
____________________________________________________________________________________________________
separable_conv2d_keras_1 (Separa (None, 80, 80, 32)    155         input_1[0][0]                    
____________________________________________________________________________________________________
batch_normalization_1 (BatchNorm (None, 80, 80, 32)    128         separable_conv2d_keras_1[0][0]   
____________________________________________________________________________________________________
separable_conv2d_keras_2 (Separa (None, 40, 40, 64)    2400        batch_normalization_1[0][0]      
____________________________________________________________________________________________________
batch_normalization_2 (BatchNorm (None, 40, 40, 64)    256         separable_conv2d_keras_2[0][0]   
____________________________________________________________________________________________________
separable_conv2d_keras_3 (Separa (None, 20, 20, 128)   8896        batch_normalization_2[0][0]      
____________________________________________________________________________________________________
batch_normalization_3 (BatchNorm (None, 20, 20, 128)   512         separable_conv2d_keras_3[0][0]   
____________________________________________________________________________________________________
conv2d_1 (Conv2D)                (None, 20, 20, 64)    8256        batch_normalization_3[0][0]      
____________________________________________________________________________________________________
batch_normalization_4 (BatchNorm (None, 20, 20, 64)    256         conv2d_1[0][0]                   
____________________________________________________________________________________________________
bilinear_up_sampling2d_1 (Biline (None, 40, 40, 64)    0           batch_normalization_4[0][0]      
____________________________________________________________________________________________________
concatenate_1 (Concatenate)      (None, 40, 40, 128)   0           bilinear_up_sampling2d_1[0][0]   
                                                                   batch_normalization_2[0][0]      
____________________________________________________________________________________________________
separable_conv2d_keras_4 (Separa (None, 40, 40, 128)   17664       concatenate_1[0][0]              
____________________________________________________________________________________________________
batch_normalization_5 (BatchNorm (None, 40, 40, 128)   512         separable_conv2d_keras_4[0][0]   
____________________________________________________________________________________________________
separable_conv2d_keras_5 (Separa (None, 40, 40, 128)   17664       batch_normalization_5[0][0]      
____________________________________________________________________________________________________
batch_normalization_6 (BatchNorm (None, 40, 40, 128)   512         separable_conv2d_keras_5[0][0]   
____________________________________________________________________________________________________
bilinear_up_sampling2d_2 (Biline (None, 80, 80, 128)   0           batch_normalization_6[0][0]      
____________________________________________________________________________________________________
concatenate_2 (Concatenate)      (None, 80, 80, 160)   0           bilinear_up_sampling2d_2[0][0]   
                                                                   batch_normalization_1[0][0]      
____________________________________________________________________________________________________
separable_conv2d_keras_6 (Separa (None, 80, 80, 64)    11744       concatenate_2[0][0]              
____________________________________________________________________________________________________
batch_normalization_7 (BatchNorm (None, 80, 80, 64)    256         separable_conv2d_keras_6[0][0]   
____________________________________________________________________________________________________
separable_conv2d_keras_7 (Separa (None, 80, 80, 64)    4736        batch_normalization_7[0][0]      
____________________________________________________________________________________________________
batch_normalization_8 (BatchNorm (None, 80, 80, 64)    256         separable_conv2d_keras_7[0][0]   
____________________________________________________________________________________________________
bilinear_up_sampling2d_3 (Biline (None, 160, 160, 64)  0           batch_normalization_8[0][0]      
____________________________________________________________________________________________________
concatenate_3 (Concatenate)      (None, 160, 160, 67)  0           bilinear_up_sampling2d_3[0][0]   
                                                                   input_1[0][0]                    
____________________________________________________________________________________________________
separable_conv2d_keras_8 (Separa (None, 160, 160, 32)  2779        concatenate_3[0][0]              
____________________________________________________________________________________________________
batch_normalization_9 (BatchNorm (None, 160, 160, 32)  128         separable_conv2d_keras_8[0][0]   
____________________________________________________________________________________________________
separable_conv2d_keras_9 (Separa (None, 160, 160, 32)  1344        batch_normalization_9[0][0]      
____________________________________________________________________________________________________
batch_normalization_10 (BatchNor (None, 160, 160, 32)  128         separable_conv2d_keras_9[0][0]   
____________________________________________________________________________________________________
conv2d_2 (Conv2D)                (None, 160, 160, 3)   99          batch_normalization_10[0][0]     
====================================================================================================
Total params: 78,681
Trainable params: 77,209
Non-trainable params: 1,472
